Documents/ОказаниеУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОказаниеУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрУслуг</xr:Item>
				<xr:Item>AccumulationRegister.РегистрМатериалов</xr:Item>
				<xr:Item>AccumulationRegister.РегистрЗаработнойПлаты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мастер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаКлиента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьМинут</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РегистрУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РегистрУслуг</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоУслуг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВыручки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьМатериалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РегистрМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РегистрМатериалов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РегистрЗаработнойПлаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РегистрЗаработнойПлаты</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЦеныМатериалов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ОказаниеУслуг/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи)

	Если Не ЗначениеЗаполнено(СтатусУслуги) Тогда
		СтатусУслуги = Перечисления.СтатусУслуги.Запланирован;
	КонецЕсли;

	СуммаУслуг = 0;

	Для Каждого СтрУслуга Из Услуги Цикл

		Если Не ЗначениеЗаполнено(СтрУслуга.Услуга) Тогда
			СтрУслуга.Стоимость = 0;
			СтрУслуга.ДлительностьМинут = 0;
			Продолжить;
		КонецЕсли;

		ДанныеУслуги = ПолучитьДанныеУслуги(СтрУслуга.Услуга);

		СтрУслуга.Стоимость = ДанныеУслуги.Цена;
		СтрУслуга.ДлительностьМинут = ДанныеУслуги.ДлительностьМинут;

		Если ЗначениеЗаполнено(СтрУслуга.ВремяНачала)
			И СтрУслуга.ДлительностьМинут > 0 Тогда

			СтрУслуга.ВремяОкончания = СтрУслуга.ВремяНачала + СтрУслуга.ДлительностьМинут * 60;

		КонецЕсли;

		СуммаУслуг = СуммаУслуг + СтрУслуга.Стоимость;

	КонецЦикла;

	Для Каждого СтрМатериал Из Материалы Цикл

		Если Не ЗначениеЗаполнено(СтрМатериал.Материал) Тогда
			СтрМатериал.Цена = 0;
			СтрМатериал.Стоимость = 0;
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрМатериал.Количество) Тогда
			СтрМатериал.Количество = 0;
		КонецЕсли;

		СтрМатериал.Цена = ПолучитьЦенуМатериалаИзРегистра(СтрМатериал.Материал, Дата);
		СтрМатериал.Стоимость = СтрМатериал.Количество * СтрМатериал.Цена;

	КонецЦикла;

	ОбщаяСумма = СуммаУслуг;

	Если СкидкаПроцент > 0 Тогда
		ОбщаяСумма = ОбщаяСумма * (100 - СкидкаПроцент) / 100;
	КонецЕсли;

КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если СтатусУслуги <> Перечисления.СтатусУслуги.Завершен Тогда

		Сообщить("Нельзя провести документ. Сначала установите статус услуги ""Завершен"".");
		Отказ = Истина;
		Возврат;

	КонецЕсли;

	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Сообщить("Не указан клиент.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Склад) Тогда
		Сообщить("Не указан склад.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Не ПроверитьОстаткиМатериалов() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.РегистрУслуг.Записывать = Истина;
	Движения.РегистрМатериалов.Записывать = Истина;
	Движения.РегистрЗаработнойПлаты.Записывать = Истина;

	ОбщаяСебестоимостьМатериалов = 0;

	Для Каждого СтрМатериал Из Материалы Цикл

		Если ЗначениеЗаполнено(СтрМатериал.Материал) Тогда
			ОбщаяСебестоимостьМатериалов = ОбщаяСебестоимостьМатериалов + СтрМатериал.Стоимость;
		КонецЕсли;

	КонецЦикла;

	КоличествоУслугДокумента = 0;

	Для Каждого СтрУслуга Из Услуги Цикл

		Если ЗначениеЗаполнено(СтрУслуга.Услуга) Тогда
			КоличествоУслугДокумента = КоличествоУслугДокумента + 1;
		КонецЕсли;

	КонецЦикла;

	Для Каждого СтрУслуга Из Услуги Цикл

		Если Не ЗначениеЗаполнено(СтрУслуга.Услуга) Тогда
			Продолжить;
		КонецЕсли;

		СуммаУслуги = СтрУслуга.Стоимость;
		СуммаСкидки = 0;

		Если СкидкаПроцент > 0 Тогда
			СуммаСкидки = СуммаУслуги * СкидкаПроцент / 100;
		КонецЕсли;

		ЧистаяВыручка = СуммаУслуги - СуммаСкидки;

		СебестоимостьПоСтроке = 0;

		Если КоличествоУслугДокумента > 0 Тогда
			СебестоимостьПоСтроке = ОбщаяСебестоимостьМатериалов / КоличествоУслугДокумента;
		КонецЕсли;

		ДвижениеУслуги = Движения.РегистрУслуг.Добавить();
		ДвижениеУслуги.Период = Дата;
		ДвижениеУслуги.Клиент = Клиент;
		ДвижениеУслуги.Мастер = СтрУслуга.Мастер;
		ДвижениеУслуги.Услуга = СтрУслуга.Услуга;
		ДвижениеУслуги.КоличествоУслуг = 1;
		ДвижениеУслуги.СуммаВыручки = ЧистаяВыручка;
		ДвижениеУслуги.СуммаСкидки = СуммаСкидки;
		ДвижениеУслуги.СебестоимостьМатериалов = СебестоимостьПоСтроке;

		Если ЗначениеЗаполнено(СтрУслуга.Мастер) Тогда

			ПроцентОтУслуг = 0;

			Если ЗначениеЗаполнено(СтрУслуга.Мастер.Должность) Тогда
				ПроцентОтУслуг = СтрУслуга.Мастер.Должность.ПроцентОтУслуг;
			КонецЕсли;

			СуммаНачислено = ЧистаяВыручка * ПроцентОтУслуг / 100;

			ДвижениеЗП = Движения.РегистрЗаработнойПлаты.Добавить();
			ДвижениеЗП.Период = Дата;
			ДвижениеЗП.Сотрудник = СтрУслуга.Мастер;
			ДвижениеЗП.ДокументОснование = Ссылка;
			ДвижениеЗП.СуммаНачислено = СуммаНачислено;

		КонецЕсли;

	КонецЦикла;

	Для Каждого СтрМатериал Из Материалы Цикл

		Если Не ЗначениеЗаполнено(СтрМатериал.Материал) Тогда
			Продолжить;
		КонецЕсли;

		ДвижениеМатериала = Движения.РегистрМатериалов.Добавить();
		ДвижениеМатериала.Период = Дата;
		ДвижениеМатериала.ВидДвижения = ВидДвиженияНакопления.Расход;
		ДвижениеМатериала.Материал = СтрМатериал.Материал;
		ДвижениеМатериала.Склад = Склад;
		ДвижениеМатериала.Количество = СтрМатериал.Количество;
		ДвижениеМатериала.Сумма = СтрМатериал.Стоимость;

	КонецЦикла;

КонецПроцедуры


Функция ПолучитьЦенуМатериалаИзРегистра(Материал, ДатаДок)

	Если Не ЗначениеЗаполнено(Материал) Тогда
		Возврат 0;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДатаДок) Тогда
		ДатаДок = ТекущаяДата();
	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦеныМатериаловСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныМатериалов.СрезПоследних(
	|		&Дата,
	|		Материал = &Материал
	|	) КАК ЦеныМатериаловСрезПоследних";

	Запрос.УстановитьПараметр("Дата", КонецДня(ДатаДок));
	Запрос.УстановитьПараметр("Материал", Материал);

	Результат = Запрос.Выполнить();

	Если Не Результат.Пустой() Тогда

		Выборка = Результат.Выбрать();

		Если Выборка.Следующий() Тогда
			Возврат Выборка.Цена;
		КонецЕсли;

	КонецЕсли;

	Возврат 0;

КонецФункции


Функция ПроверитьОстаткиМатериалов()

	ТребуетсяПоМатериалам = Новый Соответствие;

	Для Каждого СтрМатериал Из Материалы Цикл

		Если Не ЗначениеЗаполнено(СтрМатериал.Материал) Тогда
			Продолжить;
		КонецЕсли;

		Если СтрМатериал.Количество <= 0 Тогда
			Сообщить("Количество по материалу """ + Строка(СтрМатериал.Материал) + """ должно быть больше нуля.");
			Возврат Ложь;
		КонецЕсли;

		ТекущееКоличество = ТребуетсяПоМатериалам.Получить(СтрМатериал.Материал);

		Если ТекущееКоличество = Неопределено Тогда
			ТекущееКоличество = 0;
		КонецЕсли;

		ТребуетсяПоМатериалам.Вставить(
			СтрМатериал.Материал,
			ТекущееКоличество + СтрМатериал.Количество);

	КонецЦикла;

	Если ТребуетсяПоМатериалам.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;

	СписокМатериалов = Новый Массив;

	Для Каждого ЭлементСоответствия Из ТребуетсяПоМатериалам Цикл
		СписокМатериалов.Добавить(ЭлементСоответствия.Ключ);
	КонецЦикла;

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Материал КАК Материал,
	|	Остатки.КоличествоОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.РегистрМатериалов.Остатки(
	|		&Момент,
	|		Материал В (&СписокМатериалов)
	|		И Склад = &Склад
	|	) КАК Остатки";

	Запрос.УстановитьПараметр("Момент", Дата);
	Запрос.УстановитьПараметр("СписокМатериалов", СписокМатериалов);
	Запрос.УстановитьПараметр("Склад", Склад);

	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();

	Для Каждого ЭлементСоответствия Из ТребуетсяПоМатериалам Цикл

		Материал = ЭлементСоответствия.Ключ;
		Нужно = ЭлементСоответствия.Значение;

		СтрокаОстатка = ТаблицаОстатков.Найти(Материал, "Материал");

		Если СтрокаОстатка = Неопределено Тогда
			Остаток = 0;
		Иначе
			Остаток = СтрокаОстатка.Остаток;
		КонецЕсли;

		Если Остаток < Нужно Тогда

			Сообщить("Недостаточно материала """ + Строка(Материал)
				+ """ на складе. Остаток: " + Строка(Остаток)
				+ ", требуется: " + Строка(Нужно) + ".");

			Возврат Ложь;

		КонецЕсли;

	КонецЦикла;

	Возврат Истина;

КонецФункции


Функция ПолучитьДанныеУслуги(СсылкаНаУслугу)

	Результат = Новый Структура("Цена, ДлительностьМинут", 0, 0);

	Если Не ЗначениеЗаполнено(СсылкаНаУслугу) Тогда
		Возврат Результат;
	КонецЕсли;

	ОбъектУслуги = СсылкаНаУслугу.ПолучитьОбъект();

	Результат.Цена = ОбъектУслуги.Цена;
	Результат.ДлительностьМинут = ОбъектУслуги.ДлительностьМинут;

	Возврат Результат;

КонецФункции
